[
  {
    "id": "olympus-mons",
    "name": "Olympus Mons",
    "type": "volcano",
    "description": "The largest volcano in the Solar System, rising over 21 kilometers above the Martian surface",
    "location": "Western hemisphere, Tharsis Plateau",
    "coordinates": "18.4,226.0",
    "coordinatesddd": "17,-44,4000",
    "discovery": "1971 by Mariner 9",
    "facts": {
      "height": "21.9 km (13.6 mi)",
      "diameter": "600 km (373 mi)",
      "caldera_width": "85 km (53 mi)",
      "comparison": "Nearly three times Mount Everest",
      "last_eruption": "~25 million years ago",
      "atmospheric_pressure_at_summit": "72 pascals (12% of Martian average)"
    },
    "steps": [
      {
        "step": 1,
        "title": "Arrival at Tharsis",
        "description": "Welcome to the Tharsis region — the volcanic heart of Mars. Before you rises Olympus Mons, the tallest volcano in the entire Solar System.",
        "media": [
          {
            "type": "image",
            "path": "map-province-Tharsis-Mars-data-spacecraft-Global.webp",
            "caption": "Map of Tharsis Plateau with Olympus Mons location",
            "source": "https://www.britannica.com/place/Tharsis"
          }
        ]
      },
      {
        "step": 2,
        "title": "The Scale of a Titan",
        "description": "At 21.9 kilometers high, Olympus Mons towers nearly three times taller than Mount Everest. Its base stretches 600 kilometers wide — as vast as the Hawaiian Islands combined.",
        "media": [
          {
            "type": "image",
            "path": "olympuseverest.jpg",
            "caption": "Map of Tharsis Plateau with Olympus Mons location",
            "source": "https://www.youtube.com/watch?v=Cww3yVQpcjY"
          }
        ]
      },
      {
        "step": 3,
        "title": "The Summit Caldera",
        "description": "Near the summit lies a 25-kilometer-wide, 3-kilometer-deep caldera. Each collapse here marks a chapter of volcanic eruptions that shaped this colossal Martian landscape.",
        "media": []
      }
    ],
    "scientific_significance": "Reveals Mars' volcanic history and tectonic evolution",
    "exploration_missions": [
      "Mariner 9",
      "Viking Orbiters",
      "Mars Global Surveyor",
      "Mars Odyssey",
      "Mars Express",
      "Mars Reconnaissance Orbiter"
    ]
  },
  {
    "id": "valles-marineris",
    "name": "Valles Marineris",
    "type": "canyon",
    "description": "Valles Marineris is the largest canyon system in the Solar System — a colossal scar stretching more than 3,000 kilometers along Mars’ equator. It carves through the planet’s highlands like a wound from an ancient past, plunging up to 8 kilometers deep and spanning as wide as 600 kilometers. If placed on Earth, the canyon would extend from New York to Los Angeles and could swallow the entire Grand Canyon many times over. Discovered in 1971 by NASA’s Mariner 9 spacecraft, it remains one of the most breathtaking and mysterious features of the Red Planet. Scientists believe the valley was born from the stretching of Mars’ crust near the Tharsis volcanic region, later widened by landslides, erosion, and perhaps even ancient rivers. Today, Valles Marineris stands as both a monument to Mars’ violent geological history and a key to understanding whether the planet once harbored liquid water — or even life.",
    "location": "Extends from Noctis Labyrinthus in the west to chaotic terrain in the east, near the Martian equator.",
    "coordinates": "12.0,101.0",
    "coordinatesddd": "-11,19,5000",
    "discovery": "1971 by Mariner 9 Orbiter",
    "facts": {
      "length": "Over 3,000 km (1,860 mi)",
      "width": "Up to 600 km wide",
      "depth": "Up to 8 km deep",
      "comparison": "Ten times longer, twenty times wider, and six times deeper than Earth's Grand Canyon",
      "formation": "Likely originated as a tectonic rift linked to Tharsis uplift, later shaped by collapse, erosion, and possible water flow"
    },
    "steps": [
      {
        "step": 1,
        "title": "Descent Over the Red Abyss",
        "description": "From orbit, the vast gash of Valles Marineris dominates the Martian equator — a system of fractures stretching farther than the continental United States. As the camera descends, walls of red rock emerge from the haze. You’re looking at a canyon ten times longer than Earth’s Grand Canyon, its depths reaching nearly eight kilometers. Each layer of rock is a chapter of Martian history, exposed to the void.",
        "media": [
          {
            "type": "video",
            "path": "valles-marineris-1-1.webm",
            "caption": "Flyover of Valles Marineris with true-color topography.",
            "source": "NASA SVS (652)"
          },
          {
            "type": "img",
            "path": "valles-marineris-1-2.jpg",
            "caption": "Viking Orbiter mosaic of the entire canyon system.",
            "source": "NASA Image Archive"
          }
        ]
      },
      {
        "step": 2,
        "title": "Noctis Labyrinthus — The Cracked Gateway",
        "description": "At the western edge lies Noctis Labyrinthus — a labyrinth of fractured valleys formed as Mars’ crust stretched and collapsed. These chaotic depressions mark the beginning of the canyon. Beneath the dust, scientists suspect volcanic and tectonic forces once tore the land apart, leaving behind a maze of cliffs and troughs that whisper of Mars’ interior stresses.",
        "media": []
      },
      {
        "step": 3,
        "title": "Layers of Water and Time",
        "description": "Deep within the canyon, colorful strata line the walls — evidence of ancient lakes that may have once filled these valleys. Carbonate and sulfate minerals suggest that water pooled here billions of years ago. These mineral layers are more than rocks; they are the fossilized memory of a Mars that might have been habitable. In these depths, scientists see echoes of rivers, floods, and perhaps even the chemistry of life."
      },
      {
        "step": 4,
        "title": "The Great Mystery",
        "description": "As you rise above the entire canyon system, the full immensity of Valles Marineris unfolds — a planetary scar that may hold the story of Mars itself. Was it created by the weight of the Tharsis volcanoes? By tectonic forces, floods, or both? The truth is still hidden in its shadows. Yet one thing is clear: this canyon is not just a feature of Mars, but a monument to its restless past — and perhaps, a clue to its forgotten oceans.",
        "media": [
          {
            "type": "video",
            "path": "valles-marineris-3-1.png",
            "caption": "‘Flight Through Mariner Valley’ — a visual journey across Valles Marineris.",
            "source": "NASA JPL"
          }
        ]
      }
    ],
    "exploration_missions": [
      "Mariner 9",
      "Viking Orbiters",
      "Mars Global Surveyor",
      "Mars Odyssey",
      "Mars Express",
      "Mars Reconnaissance Orbiter"
    ]
  },
  {
    "id": "mars-poles",
    "name": "Mars Polar Ice Caps",
    "type": "ice_cap",
    "description": "Dynamic regions of carbon dioxide and water ice revealing Mars' climate history",
    "location": "Northern and Southern poles",
    "coordinates": "90.0,0.0",
    "coordinatesddd": "92,100,4800",
    "discovery": "1971 by Mariner 9",
    "facts": {
      "northern_cap_size": "~1,000 km (621 mi) across",
      "chasma_boreale_depth": "~2 km (1.2 mi) deep",
      "composition": "CO₂ dry ice dominates; water ice persists year-round",
      "seasonal_changes": "CO₂ sublimates in spring, refreezes in winter",
      "surface_patterns": "Spiders, starbursts, and araneiform formations"
    },
    "steps": [
      {
        "step": 1,
        "title": "The Frozen Crown of the North",
        "description": "High above the red deserts, Mars wears a crown of ice — a dazzling polar cap stretching a thousand kilometers wide. Spiraling dark canyons twist through the frost, carved by wind and time. This is the north pole of Mars — cold, ancient, and alive.",
        "media": [
          {
            "type": "image",
            "path": "35141_PIA13163.jpg",
            "caption": "Map of Tharsis Plateau with Olympus Mons location",
            "source": "https://science.nasa.gov/resource/northern-ice-cap-of-mars/"
          }
        ]
      },
      {
        "step": 2,
        "title": "The Chasma Boreale Rift",
        "description": "Cutting across the polar ice lies Chasma Boreale — a canyon as long as Earth’s Grand Canyon and nearly two kilometers deep. Radar from Mars Reconnaissance Orbiter reveals hidden layers below the surface — frozen stories of a shifting planet.",
        "media": [
          {
            "type": "image",
            "path": "mars_polar_deposits_main.webp",
            "caption": "Map of Tharsis Plateau with Olympus Mons location",
            "source": "https://www.nasa.gov/image-article/chasma-boreale-north-polar-ice-cap-of-mars/"
          }
        ]
      },
      {
        "step": 3,
        "title": "The Breath of Carbon Dioxide",
        "description": "In the spring, sunlight awakens the poles. The dry ice — frozen carbon dioxide — turns straight into gas, bursting from below and sculpting eerie shapes: spiders, starbursts, and ghostly trails. No such landscape exists on Earth.",
        "media": [
          {
            "type": "image",
            "path": "ESP_020914_0930.jpg",
            "caption": "Map of Tharsis Plateau with Olympus Mons location",
            "source": "https://science.nasa.gov/resource/dry-ice-on-mars/"
          }
        ]
      },
      {
        "step": 4,
        "title": "The Slow Dance of Ice",
        "description": "For fifty years, scientists searched for answers — why does Mars’ polar ice move so slowly? Now we know: gravity, wind, and the planet’s own heartbeat drive a slow, creeping flow that has shaped these poles for millions of years. The mystery endures… but the ice still whispers.",
        "image": []
      }
    ],
    "scientific_significance": "Reveals climate cycles, atmospheric processes, and possible water resources",
    "exploration_missions": [
      "Mariner 9",
      "Mars Global Surveyor",
      "Mars Reconnaissance Orbiter",
      "Mars Odyssey",
      "Mars Express",
      "James Webb Space Telescope"
    ]
  },
  {
    "id": "cheyava-falls",
    "name": "Cheyava Falls",
    "type": "biosignature",
    "description": "Potential biosignature discovery in Jezero Crater showing complex organic-mineral interactions",
    "location": "Bright Angel Formation, northern rim of Neretva Vallis, Jezero Crater",
    "coordinates": "18.4,77.5",
    "coordinatesddd": "18,169,4000",
    "discovery": "July 2024 by Perseverance Rover",
    "facts": {
      "age": "~3.5 billion years old",
      "sample_name": "Sapphire Canyon",
      "minerals": "Vivianite (Fe₃(PO₄)₂·8H₂O) and Greigite (Fe₃S₄)",
      "elements": "Organic carbon, iron, sulfur, phosphorus, hydrogen",
      "confidence_level": "Step 1 (potential signal, requires confirmation)"
    },
    "steps": [
      {
        "step": 1,
        "title": "The Lost River of Neretva Vallis",
        "description": "Billions of years ago, water carved deep channels into the Martian surface. Now, in the dry bed of Neretva Vallis, the Perseverance rover searches for the faint traces of that vanished world — and the life it might have sheltered.",
        "media": []
      },
      {
        "step": 2,
        "title": "The Leopard Spots of Life",
        "description": "At the 'Bright Angel' formation, Perseverance drills into a rock named Cheyava Falls. Inside the sample, called Sapphire Canyon, lie minerals—vivianite and greigite—arranged in patterns scientists call leopard spots, possible fingerprints of ancient microbes.",
        "media": [
          {
            "type": "image",
            "path": "pia26368orig.webp",
            "caption": "‘Flight Through Mariner Valley’ — a visual journey across Valles Marineris.",
            "source": "https://www.nasa.gov/news-release/nasa-says-mars-rover-discovered-potential-biosignature-last-year/"
          }
        ]
      },
      {
        "step": 3,
        "title": "Between Science and Wonder",
        "description": "The evidence is extraordinary — but not yet proof. These minerals could form without life, yet the absence of heat or acid marks deepens the mystery. In this fragment of stone, Mars may be whispering its oldest secret: that it once breathed.",
        "media": []
      }
    ],
    "scientific_significance": "First detection of simultaneous organic compounds, phosphorus, and redox-sensitive minerals in lacustrine context",
    "exploration_missions": ["Perseverance Rover (Mars 2020)"]
  }
]
